/*Напишите программу, использующую описанные ниже функции.
Fill_array() принимает в качестве аргумента имя массива элементов типа
double и размер этого массива. Она приглашает пользовате­ля ввести значения double
для помещения их в массив. Ввод прекращается при наполнении массива либо когда 
пользова­тель вводит нечисловое значение и возвращает действитель­ное количество 
элементов.
Show_array() принимает в качестве аргументов имя массива значений double,
а также его размер, и отображает содержимое массива.
Reverse_array() принимает в качестве аргумента имя массива значений
double, а также его размер, и изменяет порядок его элемен­тов на противоположный.
Программа должна использовать эти функции для наполнения массива, обра­щения 
порядка его элементов, кроме первого и последнего, с последующим отображением.*/

#include <iostream>

double Fill_array(double arr[], int n);
double Show_array(double arr[], int n);
double Reverse_array(double arr[], int n);

int main()
{

}

double Fill_array(double arr[], int n)
{
    
    std::cout << "Enter a number: ";

}

double Show_array(double arr[], int n)
{

}

double Reverse_array(double arr[], int n)
{

}

